---
kind: property
id: P:Autodesk.Revit.DB.Events.ViewPrintedEventArgs.TotalViews
source: html/f0d680d3-1d5d-4ad7-6735-b624df48a88d.htm
---
# Autodesk.Revit.DB.Events.ViewPrintedEventArgs.TotalViews Property

The number of all views being printed.

## Syntax (C#)
```csharp
public int TotalViews { get; }
```